#=============================================================================

# 1 Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

#Пример:

#- 6 -> да
#- 7 -> да
#- 1 -> нет

def InputDay():
    print("Введите номер дня недели от 1 до 7:")
    return int(input())
day = InputDay()

while day < 1 or day > 7:
    day = InputDay()

if day >= 6:
    print("Это выходной")
else:
    print("Это не выходной")

#=============================================================================